_org/notes/Angular2.html
<!DOCTYPE html>
<html>
<head>
<title>Angular2</title>
<!-- 2016-03-09 Wed 08:37 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Aurelien Bottazini">

    <link rel="stylesheet" type="text/css" href="http://aurelienbottazini.com/css/org-export.min.css">
</head>
<body>
<div id="content">
<h1 class="title">Angular2</h1>
---
layout: notes
---
<p>
Angular apps are made out of modules
For example a module can exports a <code>component class</code>
</p>

<p>
Here is a file named app/app.component.ts
</p>
<div class="org-src-container">

<pre class="src src-typescript"><span class="org-keyword">export</span> <span class="org-keyword">class</span> <span class="org-rainbow-identifiers-identifier-13">AppComponent</span> <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-rainbow-identifiers-identifier-15">&#8230;</span> <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
We can import this component from app/main.ts with
</p>
<div class="org-src-container">

<pre class="src src-typescript"><span class="org-keyword">import</span> <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-rainbow-identifiers-identifier-13">AppComponent</span><span class="org-rainbow-delimiters-depth-1">}</span> <span class="org-rainbow-identifiers-identifier-7">from</span> <span class="org-string">'./app/app.component'</span>;
</pre>
</div>

<p>
Angular2 of course has librairies. To import a component from the standard
library:
</p>
<div class="org-src-container">

<pre class="src src-typescript"><span class="org-keyword">import</span> <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-rainbow-identifiers-identifier-8">Component</span><span class="org-rainbow-delimiters-depth-1">}</span> <span class="org-rainbow-identifiers-identifier-7">from</span> <span class="org-string">'angular2/core'</span>;
</pre>
</div>

<p>
A component controls a <i>patch</i> of the screen, like a view.
Angular creates, updates, removes component and the developer can take action
through this lifecycle through Lifecycle hooks.
</p>

<p>
Templates are available to design component views.
</p>

<p>
We use metadata to tell angular how to process a class
for example
</p>

<div class="org-src-container">

<pre class="src src-typescript">@<span class="org-rainbow-identifiers-identifier-8">Component</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-rainbow-identifiers-identifier-7">selector</span>: <span class="org-string">'hero-list'</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">creates an instance of this component when we find a &lt;hero-list&gt; tag</span>
  <span class="org-rainbow-identifiers-identifier-5">templateUrl</span>: <span class="org-string">'app/hero-list.component.html'</span>,
  <span class="org-rainbow-identifiers-identifier-11">directives</span>: <span class="org-rainbow-delimiters-depth-2">[</span><span class="org-rainbow-identifiers-identifier-9">HeroDetailComponent</span><span class="org-rainbow-delimiters-depth-2">]</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">directives required by this component</span>
  <span class="org-rainbow-identifiers-identifier-3">providers</span>: <span class="org-rainbow-delimiters-depth-2">[</span><span class="org-rainbow-identifiers-identifier-15">HeroService</span><span class="org-rainbow-delimiters-depth-2">]</span> <span class="org-comment-delimiter">// </span><span class="org-comment">services required by this component, provided by dependency injection</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-keyword">export</span> <span class="org-keyword">class</span> <span class="org-rainbow-identifiers-identifier-15">HeroesComponent</span> <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-rainbow-identifiers-identifier-15">&#8230;</span> <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Angular attaches the metadata to the class definition. At runtime this metadata
is used by angular to do the <i>right</i> things.
</p>

<p>
Angular supports 4 way of data bindings
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">one way </span><span class="org-comment-delimiter">--&gt;</span>

&lt;<span class="org-function-name">div</span>&gt;{{hero.name}}&lt;/<span class="org-function-name">div</span>&gt; <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">interpolation, from component to dom  </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">hero-detail</span> [hero]=<span class="org-string">"selectedHero"</span>&gt;&lt;/<span class="org-function-name">hero-detail</span>&gt; <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">property binding, from component to dom  </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">div</span> (click)=<span class="org-string">"selectHero(hero)"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt; <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">event binding, from dom to component  </span><span class="org-comment-delimiter">--&gt;</span>

<span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">two way </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">input</span> [(ngModel)]=<span class="org-string">"hero.name"</span>&gt;
</pre>
</div>

<p>
A directive is a class with directive metadata
So a component is a <i>directive-with-a-template</i>
Other kind of directives are <i>structural</i> and <i>attributes</i> directives.
</p>

<p>
Structural directives alter layouts by adding, replacing, removing dom elements.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span class="org-function-name">div</span> *ngFor=<span class="org-string">"#hero of heroes"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
&lt;<span class="org-function-name">hero-detail</span> *ngIf=<span class="org-string">"selectedHero"</span>&gt;&lt;/<span class="org-function-name">hero-detail</span>&gt;
</pre>
</div>
<p>
The (*) prefix to the div indicates that the div element and its children constitute a master template.
The (#) prefix before hero identifies hero as a local template variable
</p>

<p>
Attribute directives alter the behaviour of an existing element
</p>
<div class="org-src-container">

<pre class="src src-html">&lt;<span class="org-function-name">input</span> [(ngModel)]=<span class="org-string">"hero.name"</span>]&gt;
</pre>
</div>

<p>
Other examples of attributes directives are <code>ngSwitch</code>, <code>ngStyle</code>, <code>ngClass</code>
</p>

<p>
There is no service base class. Angular does not enforce good services but
written small, dedicated services will help you writing good angular
applications through dependency injection.
</p>

<p>
We can register providers at any level of the application component tree
</p>

<div class="org-src-container">

<pre class="src src-typescript"><span class="org-rainbow-identifiers-identifier-7">bootstrap</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-identifiers-identifier-13">AppComponent</span>, <span class="org-rainbow-delimiters-depth-2">[</span><span class="org-rainbow-identifiers-identifier-9">BackendService</span>, <span class="org-rainbow-identifiers-identifier-15">HeroService</span>, <span class="org-rainbow-identifiers-identifier-2">Logger</span><span class="org-rainbow-delimiters-depth-2">]</span><span class="org-rainbow-delimiters-depth-1">)</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">when we</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">bootstrap the application</span>

@<span class="org-rainbow-identifiers-identifier-8">Component</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">{</span>
  <span class="org-rainbow-identifiers-identifier-3">providers</span>:   <span class="org-rainbow-delimiters-depth-3">[</span><span class="org-rainbow-identifiers-identifier-15">HeroService</span><span class="org-rainbow-delimiters-depth-3">]</span>
<span class="org-rainbow-delimiters-depth-2">}</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-keyword">export</span> <span class="org-keyword">class</span> <span class="org-rainbow-identifiers-identifier-15">HeroesComponent</span> <span class="org-rainbow-delimiters-depth-1">{</span> ... <span class="org-rainbow-delimiters-depth-1">}</span> <span class="org-comment-delimiter">// </span><span class="org-comment">at the component level</span>

<span class="org-keyword">constructor</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">private</span> <span class="org-rainbow-identifiers-identifier-4">_service</span>: <span class="org-rainbow-identifiers-identifier-15">HeroService</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-rainbow-delimiters-depth-1">}</span> <span class="org-comment-delimiter">// </span><span class="org-comment">at the constructor level</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aurelien Bottazini</p>
<p class="date">Created: 2016-03-09 Wed 08:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
